Cas_1b/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
    (4.5 10 0)    // 0
    (5.5 10 0)    // 1
    (5.5 11 0)    // 2
    (4.5 11 0)    // 3
    (4.5 10 1)    // 4
    (5.5 10 1)    // 5
    (5.5 11 1)    // 6
    (4.5 11 1)    // 7
    (0 0 0)       // 8
    (4.5 0 0)     // 9
    (0 10 0)      // 10
    (0 0 1)       // 11
    (4.5 0 1)     // 12
    (0 10 1)      // 13
    (5.5 0 0)     // 14
    (5.5 0 1)     // 15
    (10 0 0)      // 16
    (10 10 0)     // 17
    (10 0 1)      // 18
    (10 10 1)     // 19
);

blocks
(
    // Injection
    hex (0 1 2 3 4 5 6 7) (64 64 1) simpleGrading (1 1 1)

    // Block gauche
    hex (8 9 0 10 11 12 4 13) (64 64 1) simpleGrading (1 1 1)

    // Block central
    hex (9 14 1 0 12 15 5 4) (64 64 1) simpleGrading (1 1 1)

    // Block Droit
    hex (14 16 17 1 15 18 19 5) (64 64 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (3 7 4 0)
            (0 4 13 10)
            (10 13 11 8)
            (8 11 12 9)
            (9 12 15 14)
            (14 15 18 16)
            (16 18 19 17)
            (17 19 5 1)
            (1 5 6 2)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
          // Front
            (0 1 2 3)
            (8 9 0 10)
            (9 14 1 0)
            (14 16 17 1)
          // Back
            (4 5 6 7)
            (11 12 4 13)
            (12 15 5 4)
            (15 18 19 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
